pages/summer-2024.org
#+title: Summer Log
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../globalStyle.css" />
#+OPTIONS: html-style:nil H:1 num:nil toc:nil
This is a log of my summer (2024) projects.  It's my immodest way of
enforcing productivity.  Feel free to reach out if you want to talk
about anything below.
* Reading
** *How Do We Look*, Mary Beard
** *Thus Spoke Zarathustra*, Friedrich Nietzsche
** *The Lily of the Field and the Bird of the Air*, Søren Kierkegaard
** *Elm Guide*, Evan Czaplicki ([[https://guide.elm-lang.org][link]])
*** Honestly, I skimmed it
** *Angels and Saints*, Eliot Weinberger
** *Art in the After-Culture*, Ben Davis
*** Highly recommended
** *The Threepenny Opera*, Bertolt Brecht
** *The Pillowman*, Martin McDonagh
** *Crime and Punishment*, Fyodor Dostoevsky
** *Adorno, Foucault and the Critique of the West*, Deborah Cook
** *Means and Ends*, Zoe Baker
* Projects
** *Visualizers for Stack-Oriented Languages*
+ While teaching CS320, I spent a lot of time walking through the
  evaluation of stack oriented languages.  I'd like to use Elm to
  build nicer visualizations of this process.
+ [[file:stack-vis-prototype.html][A rudimentary prototype]]
+ [[file:diane-proto-ii.html][A slightly more interesting prototype]]
+ [[file:diane-proto-iv.html][A mock-up playground for a simple language]]
** *Overture: A Personal Agda Library*
+ I'd like to spend more time digging into the [[https://github.com/agda/agda-stdlib][Agda standard library]].
  As an exercise in library management, I'm also extending it.
+ /Disclaimer./ I have no intention of maintaining this beyond
  personal use.
+ [[https://github.com/nmmull/Overture][The repository]]
** *Fermat's Little Theorem in Agda*
+ For their final project, a student in CS400 attempted to prove
  Fermat's little theorem in Agda (without the standard library).  I
  was impressed by how far they got, but eventually things get tricky
  when you start reasoning about summations.  I decided to put
  together a proof myself using the standard library.  It was hairer
  than I expected...
+ The proof appears in the Overture repository.
** *Diane: A Toy Stack-Oriented Language*
+ I built my first larger-scale prototype of a visualizer for a
  stack-oriented language
+ [[https://nmmull.github.io/Diane/index.html][The website]]
