pages/summer-2024.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-06-30 Sun 17:30 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Summer Log</title>
<meta name="author" content="Nathan  Mull" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../globalStyle.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Summer Log</h1>
<p>
This is a log of my summer (2024) projects.  It's my immodest way of
enforcing productivity.  Feel free to reach out if you want to talk
about anything below.
</p>
<div id="outline-container-org9568220" class="outline-2">
<h2 id="org9568220">Reading</h2>
<div class="outline-text-2" id="text-org9568220">
</div>
<ul class="org-ul">
<li><a id="org7ebc74a"></a><b>How Do We Look</b>, Mary Beard<br /></li>
<li><a id="org20b4486"></a><b>Thus Spoke Zarathustra</b>, Friedrich Nietzsche<br /></li>
<li><a id="org8868622"></a><b>The Lily of the Field and the Bird of the Air</b>, Søren Kierkegaard<br /></li>
<li><a id="orge3ea508"></a><b>Elm Guide</b>, Evan Czaplicki (<a href="https://guide.elm-lang.org">link</a>)<br />
<ul class="org-ul">
<li><a id="orgfe27564"></a>Honestly, I skimmed it<br /></li>
</ul>
</li>
<li><a id="orgb9f9bf5"></a><b>Angels and Saints</b>, Eliot Weinberger<br /></li>
<li><a id="orgdb91072"></a><b>Art in the After-Culture</b>, Ben Davis<br />
<ul class="org-ul">
<li><a id="orgf118ba0"></a>Highly recommended<br /></li>
</ul>
</li>
<li><a id="orgc95d538"></a><b>The Threepenny Opera</b>, Bertolt Brecht<br /></li>
<li><a id="org580690d"></a><b>The Pillowman</b>, Martin McDonagh<br /></li>
<li><a id="orgf10fc0d"></a><b>Crime and Punishment</b>, Fyodor Dostoevsky<br /></li>
<li><a id="org36550de"></a><b>Adorno, Foucault and the Critique of the West</b>, Deborah Cook<br /></li>
<li><a id="org63d55b4"></a><b>Means and Ends</b>, Zoe Baker<br /></li>
</ul>
</div>
<div id="outline-container-org72627a1" class="outline-2">
<h2 id="org72627a1">Projects</h2>
<div class="outline-text-2" id="text-org72627a1">
</div>
<ul class="org-ul">
<li><a id="orgd99300c"></a><b>Visualizers for Stack-Oriented Languages</b><br />
<div class="outline-text-3" id="text-orgd99300c">
<ul class="org-ul">
<li>While teaching CS320, I spent a lot of time walking through the
evaluation of stack oriented languages.  I'd like to use Elm to
build nicer visualizations of this process.</li>
<li><a href="stack-vis-prototype.html">A rudimentary prototype</a></li>
<li><a href="diane-proto-ii.html">A slightly more interesting prototype</a></li>
<li><a href="diane-proto-iv.html">A mock-up playground for a simple language</a></li>
</ul>
</div>
</li>
<li><a id="org7251a1f"></a><b>Overture: A Personal Agda Library</b><br />
<div class="outline-text-3" id="text-org7251a1f">
<ul class="org-ul">
<li>I'd like to spend more time digging into the <a href="https://github.com/agda/agda-stdlib">Agda standard library</a>.
As an exercise in library management, I'm also extending it.</li>
<li><i>Disclaimer.</i> I have no intention of maintaining this beyond
personal use.</li>
<li><a href="https://github.com/nmmull/Overture">The repository</a></li>
</ul>
</div>
</li>
<li><a id="org8c4dc96"></a><b>Fermat's Little Theorem in Agda</b><br />
<div class="outline-text-3" id="text-org8c4dc96">
<ul class="org-ul">
<li>For their final project, a student in CS400 attempted to prove
Fermat's little theorem in Agda (without the standard library).  I
was impressed by how far they got, but eventually things get tricky
when you start reasoning about summations.  I decided to put
together a proof myself using the standard library.  It was hairer
than I expected&#x2026;</li>
<li>The proof appears in the Overture repository.</li>
</ul>
</div>
</li>
<li><a id="orgc618e05"></a><b>Diane: A Toy Stack-Oriented Language</b><br />
<div class="outline-text-3" id="text-orgc618e05">
<ul class="org-ul">
<li>I built my first larger-scale prototype of a visualizer for a
stack-oriented language</li>
<li><a href="https://nmmull.github.io/Diane/index.html">The website</a></li>
</ul>
</div>
</li>
</ul>
</div>
</div>
</body>
</html>
